In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {"name":["priyanka", "soni", "amit", "rahul"],
        "marks":[34, 67, 45, 42],
        "City":["Delhi", "Bihar", "Rajasthan", "Kolkata"]}

In [19]:
df = pd.DataFrame(dict1)

In [20]:
df

       name  marks       City
0  priyanka     34      Delhi
1      soni     67      Bihar
2      amit     45  Rajasthan
3     rahul     42    Kolkata